# HeroesOfPymoli

*  This report is for a Gaming company. It consists of analyzing the data for their most recent fantasy game Heroes of Pymoli. It breaks down the game's purchasing data into meaningful insights.

In [34]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
  color: black !important;
}
</style>

In [166]:
#extract the filename to be read and analyzed
import numpy as np
import os
filename = os.path.join("Resources", "purchase_data.csv")

In [167]:
import pandas as pd
df = pd.read_csv(filename)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Total number of Players

In [168]:
pd.DataFrame({"Total Players": [df["SN"].unique().size]})

   Total Players
0            576

## Purchasing Analysis (Total)

* Number of Unique Items
* Total Number of Purchases
* Total Revenue
* Average Purchase Price

In [169]:
df1= df["Price"].agg({"Total Number of Purchases":'count',"Total Revenue": 'sum', "Average Purchase Price":'mean'}).to_frame().T.reset_index(drop=True)

df2 = pd.DataFrame({"Number of Unique Items" : [df["Item ID"].nunique()],\
                    "Total Number of Purchases":df1['Total Number of Purchases'].astype(int),\
                    "Total Revenue":['$' + df1['Total Revenue'][0].astype(str)],\
                    "Average Purchase Price":['$' + df1['Average Purchase Price'][0].round(2).astype(str)]\
                   })
df2

,Number of Unique Items,Total Number of Purchases,Total Revenue,Average Purchase Price
0,183,780,$2379.77,$3.05

## Gender Demographics

* Count of Female, Male and Other Players

In [170]:
df_gender_group = df.groupby(["Gender"])
gender_count = df_gender_group["SN"].nunique()

* Percentage of Female, Male and Other Players

In [171]:
gender_percent = gender_count*100/gender_count.sum()

In [172]:
gender_demograph = pd.DataFrame({'Total Count': [gender_count['Female'],gender_count['Male'],gender_count['Other / Non-Disclosed']],\
                                 'Percent of Players' : [gender_percent['Female'].round(2).astype(str)+'%',\
                                                         gender_percent['Male'].round(2).astype(str)+'%',\
                                                         gender_percent['Other / Non-Disclosed'].round(2).astype(str)+'%']\
    
})
gender_demograph.set_index(pd.Index(['Female', 'Male', 'Other']))

        Total Count Percent of Players
Female           81             14.06%
Male            484             84.03%
Other            11              1.91%

## Purchasing Analysis (Gender)

### Purchase Count
### Average Purchase Price
### Total Purchase Value

In [174]:
df_pur_ana = df.groupby(['Gender'])["Price"].agg(['count', 'mean', 'sum'])
purchase_analysis = pd.DataFrame({\
                                  'Purchase Count': df_pur_ana['count'].values,\
                                  'Average Purchase Price' : '$' + np.char.array((df_pur_ana['mean'].values).round(2).astype(str)),\
                                  'Total Purchase Value':'$' + np.char.array((df_pur_ana['sum'].values).round(2).astype(str))\
                                 })

### Average Purchase Total per Person by Gender

In [175]:
purchase_analysis['Avg Total Purchase per Person'] = '$' + np.char.array(((df_pur_ana['sum']/gender_count).values).round(2).astype(str))
purchase_analysis.set_index(pd.Index(['Female', 'Male', 'Other']))

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.2,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other,15,$3.35,$50.19,$4.56

## Age Demographics

In [176]:
bins = pd.cut(df['Age'],  [0, 9, 14, 19,24,29,34, 39, 44,49 ])
group_names = ["<10", "10-14", "15-19","20-24", "25-29", "30-34", "35-39", "40-44", "45-49"]

 The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
* Purchase Count
* Average Purchase Price
* Total Purchase Value

In [198]:
df_age_group = df.groupby(bins)
age_count = df_age_group["SN"].nunique()
age_percent = age_count*100/age_count.sum()

df_age_stat = pd.DataFrame({ 'Total Count' : age_count.values,\
                           'Percentage Players': np.char.array(age_percent.values.round(2).astype(str))+'%'}, index=group_names)
df_age_stat.rename_axis('Age Ranges')

            Total Count Percentage Players
Age Ranges
<10                  17              2.95%
10-14                22              3.82%
15-19               107             18.58%
20-24               258             44.79%
25-29                77             13.37%
30-34                52              9.03%
35-39                31              5.38%
40-44                11              1.91%
45-49                 1              0.17%

In [178]:
df_new = df_age_group['Price'].agg(['count', 'mean','sum'])

In [179]:
df_new = df.groupby(bins)['Price'].agg(['count', 'mean','sum'])

* Average Purchase Total per Person by Age Group

In [180]:
avrg_pur_total_per_person = (df_age_group['Price'].sum()/age_count).rename("Average")

* Creating a Data Frame for display

In [181]:
Age_demo_df=pd.DataFrame({'Purchase Count': df_new['count'].values,\
                     'Average Purchase Price' : '$' + np.char.array((df_new['mean'].values).round(2).astype(str)),\
                     'Total Purchase Value':'$' + np.char.array((df_new['sum'].values).round(2).astype(str)),\
                     'Avrg Purchase Total per Person by Age': '$' + np.char.array((avrg_pur_total_per_person.values).round(2).astype(str))\
})
Age_demo_df.set_index(pd.Index(group_names)).rename_axis('Age Ranges')

,Purchase Count,Average Purchase Price,Total Purchase Value,Avrg Purchase Total per Person by Age
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.9,$293.0,$3.81
30-34,73,$2.93,$214.0,$4.12
35-39,41,$3.6,$147.67,$4.76
40-44,12,$3.04,$36.54,$3.32
45-49,1,$1.7,$1.7,$1.7

### Top Spenders
#### Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
* SN
* Purchase Count
* Average Purchase Price
* Total Purchase Value

In [182]:
df_person = df.groupby(["SN"])["Price"].agg(['count','mean', 'sum']).sort_values(by = "sum", ascending = False)[0:5]

spender_df = pd.DataFrame({\
                           'Purchase Count': df_person['count'].values,\
                           'Average Purchase Price' : '$' + np.char.array((df_person['mean'].values).round(2).astype(str)),\
                           'Total Purchase Value':'$' + np.char.array((df_person['sum'].values).round(2).astype(str))\
                           }, index = df_person.index)


spender_df

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                   $3.4               $13.62
Iskadarya95               3                  $4.37                $13.1

### Most Popular Items
#### Identify the 5 most popular items by purchase count, then list (in a table):
* Item ID
* Item Name
* Purchase Count
* Item Price
* Total Purchase Value

In [183]:
df_item_group = df.groupby('Item ID')['Price'].agg(['count', 'sum'])
df_1 = df_item_group.sort_values(by = 'count', ascending = False)[0:5]

In [199]:
df_2 = pd.merge(df_1, df, on="Item ID")
df_2 = df_2.groupby('Item ID')["Item ID", "count", 'sum', 'Item Name', 'Price'].apply(lambda x:x).drop_duplicates()

item_df_popular = pd.DataFrame({'Item ID':df_2['Item ID'],\
                        'Item Name':df_2['Item Name'],\
                        'Purchase Count':df_2['count'],\
                        'Item Price':'$' + np.char.array((df_2['Price'].values).round(2).astype(str)),\
                        'Total Purcase Value':'$' + np.char.array((df_2['sum'].values).round(2).astype(str))})
item_df_popular.set_index('Item ID')

,Item Name,Purchase Count,Item Price,Total Purcase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.9,$44.1
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

### Most Profitable Items
#### Identify the 5 most profitable items by total purchase value, then list (in a table):
* Item ID
* Item Name
* Purchase Count
* Item Price
* Total Purchase Value

In [200]:
df_3 = df_item_group.sort_values(by = 'sum', ascending = False)[0:5]
df_3 = (pd.merge(df_3, df, on="Item ID")).groupby('Item ID')["Item ID", "count", 'sum', 'Item Name', 'Price'].apply(lambda x:x).drop_duplicates()


item_df_profit = pd.DataFrame({'Item ID':df_3['Item ID'],\
                        'Item Name':df_3['Item Name'],\
                        'Purchase Count':df_3['count'],\
                        'Item Price':'$' + np.char.array((df_3['Price'].values).round(2).astype(str)),\
                        'Total Purcase Value':'$' + np.char.array((df_3['sum'].values).round(2).astype(str))})
item_df_profit.set_index('Item ID')

,Item Name,Purchase Count,Item Price,Total Purcase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.9,$44.1
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.8